require 'socket'

# Common
brew "bat"
brew "fd"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "jq"
brew "neovim"
brew "nodejs"
brew "pyenv"
brew "ripgrep"
brew "stow"
brew "universal-ctags"
brew "zoxide"
brew "btop"
cask "1password"
cask "aerospace"
cask "ghostty"
cask "google-chrome"
cask "hammerspoon"
cask "karabiner-elements"
cask "obsidian"
cask "raycast"
cask "spotify"
cask "zoom"
cask "activitywatch"
cask "dash"

if Socket.gethostname == "turbochardo"
  # Personal
  brew "lowdown"
  brew "trash"
  brew "rbenv"
  cask "arq"
  cask "cleanshot"
  cask "cursor"
  cask "fantastical"
  cask "google-drive"
  cask "tailscale"
  cask "vlc"
  cask "zwift"
else
  brew "awscli"
  brew "antlr"
  brew "oven-sh/bun/bun"
  brew "chart-testing"
  brew "eslint"
  brew "gettext"
  brew "helm"
  brew "kubernetes-helm"
  brew "kubectl"
  brew "postgresql@14"
  brew "skaffold"
  brew "terraform"
  brew "xz"

  # Work-Only Casks
  cask "orbstack"
  cask "setapp"
  cask "google-cloud-sdk"
  cask "mimestream"
  cask "meetingbar"
  cask "slack"
end

