hostname = `hostname`.strip

brew "git"
brew "mise"
brew "trash"
brew "fish"
brew "bash"
brew "terminal-notifier"
brew "nodejs"

brew "uv"
brew "atuin"
brew "bat"
brew "direnv"
brew "difftastic"
brew "fd"
brew "fzf"
brew "gh"
brew "hyperfine"
brew "jj"
brew "jjui"
brew "jq"
brew "neovim"
brew "ripgrep"
brew "zoxide"
brew "tmux"

cask "google-chrome"
cask "1password"
cask "hammerspoon"
cask "raycast"
cask "spotify"
cask "cleanshot"
cask "slack"
cask "ghostty"
cask "discord"
cask "orbstack"
cask "nikitabobko/tap/aerospace"
cask "karabiner-elements"
cask "macwhisper"
cask "antinote"
cask "zed"
cask "claude"
cask "cursor"
cask "codex"
cask "1password-cli"
cask "dash"

if hostname == "turbochardo"
  cask "tailscale"
  cask "zwift"
end
