# vim: set ft=ruby

require 'socket'

brew "bat"
brew "fd"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "jq"
brew "neovim"
brew "nodejs"
brew "ripgrep"
brew "stow"
brew "universal-ctags"
brew "zoxide"
brew "btop"
brew "direnv"
brew "chrome-cli"
brew "age"
brew "uv"
brew "switchaudio-osx"
brew "blueutil"
cask "font-jetbrains-mono-nerd-font"
cask "1password-cli"
cask "1password"
cask "aerospace"
cask "ghostty"
cask "google-chrome"
cask "hammerspoon"
cask "karabiner-elements"
cask "obsidian"
cask "raycast"
cask "spotify"
cask "zoom"
cask "brave-browser"
cask "kitty"
cask "anki"
cask "cursor"

vscode "asvetliakov.vscode-neovim"
vscode "jdinhlife.gruvbox"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "charliermarsh.ruff"
vscode "esbenp.prettier-vscode"


if Socket.gethostname == "turbochardo"
  brew "lowdown"
  brew "trash"
  brew "rbenv"
  brew "hyperfine"
  cask "arq"
  cask "cleanshot"
  cask "google-drive"
  cask "tailscale"
  cask "vlc"
  cask "zwift"
  cask "dash"

  vscode "bwork.zig-tools"
  vscode "tiehuis.zig"
  vscode "ziglang.vscode-zig"
else
  # install awscli and terraform manually
  brew "antlr"
  brew "oven-sh/bun/bun"
  brew "chart-testing"
  brew "eslint"
  brew "gettext"
  brew "helm"
  brew "kubernetes-helm"
  brew "kubectl"
  brew "postgresql@14"
  brew "skaffold"
  brew "xz"
  cask "orbstack"
  cask "setapp"
  cask "google-cloud-sdk"
  cask "meetingbar"
  cask "slack"
end

